FirstRoutesAndControllers/app/controllers/users_controller.rb

    def create
        user = User.new(params.require(:user).permit(:email, :name))
        if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "Raz"], ["email", "raz@app.com"]]

    def update
        user = User.find(params[:id])

        if user.update(params.require(:user).permit(:email, :name))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "joey@app.com"], ["id", 5]]